УТ_для_edt/src/Documents/смартУстановкаУсловийДополнительнойГарантии/смартУстановкаУсловийДополнительнойГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаУсловийДополнительнойГарантии</name>
  <comment>//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.</comment>
  <registerRecords>InformationRegister.смартУсловияДополнительнойГарантии</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГарантииНаОборудование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГарантииНаГоловку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопГарантииНаПервомЭтапе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопГарантииНаВторомЭтапе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействияУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействияУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартУстановкаУсловийДополнительнойГарантии/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Автор = ПараметрыСеанса.АвторизованныйПользователь;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	
	УстановитьПараметрыСпискаНоменклатуры(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаНоменклатуры(Оборудование)  
	
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Оборудование", Оборудование);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти  

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)  
	
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()  
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СписокОборудованияДатаНачалаДействияУсловийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если НЕ ПроверитьПравильностьДат() Тогда 
		
		ТекущиеДанные.ДатаНачалаДействияУсловий = Дата(1, 1, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияДатаОкончанияДействияУсловийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если НЕ ПроверитьПравильностьДат() Тогда 
		
		ТекущиеДанные.ДатаОкончанияДействияУсловий = Дата(1, 1, 1);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте 
Функция ПроверитьПравильностьДат()
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачалаДействияУсловий)
		И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончанияДействияУсловий)
		И ТекущиеДанные.ДатаОкончанияДействияУсловий < ТекущиеДанные.ДатаНачалаДействияУсловий Тогда
		
		ПоказатьПредупреждение(, "Дата окончания действия условий не может быть меньше даты начала!");
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокОборудованияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда  
		
		УстановитьПараметрыСпискаНоменклатуры(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		
	Иначе 
			
		УстановитьПараметрыСпискаНоменклатуры(ТекущиеДанные.Оборудование);
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияОборудованиеПриИзменении(Элемент)  
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;  
	
	УстановитьПараметрыСпискаНоменклатуры(ТекущиеДанные.Оборудование);
	
КонецПроцедуры
